Repository: JohnKlenov/TemplateSwiftUIProject
Catalog: TemplateSwiftUIProject/*.lproj/Localizable.strings
Languages: es, ru

# network_status_banner.no_internet_connection
source: No internet connection
es: Sin conexión a Internet
ru: Нет соединения с Интернетом

# tab.home
source: Home
es: Inicio
ru: Главная

# tab.gallery
source: Gallery
es: Galería
ru: Галерея

# tab.profile
source: Profile
es: Perfil
ru: Профиль

# home.title
source: Home
es: Inicio
ru: Главная

# home.add_button
source: Add
es: Agregar
ru: Добавить

# home.loading
source: Loading...
es: Cargando...
ru: Загрузка...

# home.bookRowView.swipeActions_delete
source: delete
es: eliminar
ru: удалить

# home.contentErrorView.title
source: Ups :(
ru: Упс :(

# home.contentErrorView.description
source: Try again! Something went wrong!
es: ¡Inténtalo de nuevo! ¡Algo salió mal!
ru: Попробуйте еще раз! Что-то пошло не так!

# home.contentErrorView.refresh_button
source: Refresh
es: Actualizar
ru: Обновить

# empty_state_view.title
source: Empty. Add new records!
es: Vacío. ¡Agrega nuevos registros!
ru: Пусто. Добавьте новые записи!

# book_details.title
source: Title
es: Título
ru: Название

# book_details.description
source: Description
es: Descripción
ru: Описание

# book_details.author
source: Author
es: Autor
ru: Автор

# book_details.go_to_some_view_button
source: Go To Some View
es: Ir a alguna vista
ru: Перейти к другому виду

# book_details.navigation_title
source: Book Details
es: Detalles del libro
ru: Детали книги

# book_details.edit_button
source: Edit
es: Editar
ru: Редактировать

# book_edit.cancel
source: Cancel
es: Cancelar
ru: Отмена

# book_edit.done
source: Done
es: Hecho
ru: Готово

# book_edit.save
source: Save
es: Guardar
ru: Сохранить

# book_edit.new_book
source: New book
es: Nuevo libro
ru: Новая книга

# book_edit.book_section
source: Book
es: Libro
ru: Книга

# book_edit.title
source: Title
es: Título
ru: Название

# book_edit.description
source: Description
es: Descripción
ru: Описание

# book_edit.path_image
source: PathImage
es: Ruta de la imagen
ru: Путь к изображению

# book_edit.author_section
source: Author
es: Autor
ru: Автор

# book_edit.author
source: Author
es: Autor
ru: Автор

# book_edit.delete_book
source: Delete book
es: Eliminar libro
ru: Удалить книгу

# book_edit.confirmation_dialog
source: Are you sure?
es: ¿Estás seguro?
ru: Вы уверены?

# profile.title
source: Account
ru: Аккаунт

# profile.toggleCellView.notification
source: Notification
ru: Уведомления

# profile.toggleCellView.dark_mode
source: Dark mode
ru: Тёмная тема

# profile.navigationCellView.change_language
source: Change language
ru: Сменить язык

# profile.navigationCellView.about_us
source: About Us
ru: О нас

# profile.navigationCellView.create_account
source: Create Account
ru: Создать аккаунт

# profile.deleteAccountCellView.delete_account
source: Delete Account
ru: Удалить аккаунт

# profile.deleteAccountCellView.confirmation_title
source: Delete Account
ru: Удалить аккаунт

# profile.deleteAccountCellView.confirmation_message
source: Are you sure you want to delete your account? This action cannot be undone.
ru: Вы уверены, что хотите удалить аккаунт? Это действие нельзя отменить.

# profile.deleteAccountCellView.confirmation_delete_button
source: Delete
ru: Удалить

# profile.deleteAccountCellView.confirmation_cancel_button
source: Cancel
ru: Отмена

# profile.userInfoCellView.guest
source: Guest
ru: Гость

# profile.userInfoCellView.no_name
source: No name
ru: Без имени

# profile.userInfoCellView.anonymous_mode
source: Anonymous mode
ru: Анонимный режим

# profile.userInfoCellView.error
source: Profile loading error
ru: Ошибка загрузки профиля

# profile.userInfoCellView.loading
source: Loading...
ru: Загрузка...

# profile.userInfoCellView.no_last_name
source: Last name not specified
ru: Фамилия не указана

# profile.changeLanguageView.title
source: Change Language
ru: Сменить язык

# profile.userInfoEditView.title
source: Edit Profile
ru: Редактировать профиль

# profile.userInfoEditView.edit_photo
source: Edit Photo
ru: Изменить фото

# profile.userInfoEditView.name
source: Name
ru: Имя

# profile.userInfoEditView.last_name
source: Last Name
ru: Фамилия

# profile.userInfoEditView.done
source: Done
ru: Готово

# profile.userInfoEditView.dialog_edit_photo
source: Edit Photo
ru: Изменить фото

# profile.userInfoEditView.choose_from_library
source: Choose from Library
ru: Выбрать из библиотеки

# profile.userInfoEditView.take_photo
source: Take Photo
ru: Сделать фото

# profile.userInfoEditView.delete_photo
source: Delete Photo
ru: Удалить фото

# profile.userInfoEditView.camera_placeholder
source: Camera View Placeholder
ru: Заглушка камеры

# signup.email_placeholder
source: Enter email
es: Ingrese correo electrónico
ru: Введите email

# signup.password
source: Password
es: Contraseña
ru: Пароль

# signup.password_placeholder
source: Enter password
es: Ingrese contraseña
ru: Введите пароль

# signup.register
source: Register
es: Registrarse
ru: Зарегистрироваться

# signup.or
source: OR
es: O
ru: ИЛИ

# signup.already_have_account
source: Already have an account?
es: ¿Ya tienes una cuenta?
ru: Уже есть аккаунт?

# signup.sign_in
source: Sign In
es: Iniciar sesión
ru: Войти

# signup.navigation_title
source: Create Account
es: Crear cuenta
ru: Создать аккаунт

# profile.signInView.title
source: Sign In
ru: Вход

# profile.signInView.email
source: Email
ru: Электронная почта

# profile.signInView.email_placeholder
source: Enter your email
ru: Введите вашу почту

# profile.signInView.password
source: Password
ru: Пароль

# profile.signInView.password_placeholder
source: Enter your password
ru: Введите ваш пароль

# profile.signInView.forgot_password
source: Forgot Password?
ru: Забыли пароль?

# profile.signInView.login
source: Login
ru: Войти

# profile.signInView.or
source: OR
ru: ИЛИ

# profile.signInView.no_account
source: Don't have an account?
ru: Нет аккаунта?

# profile.signInView.sign_up
source: Sign Up
ru: Регистрация

# profile.signInView.anonymous_warning_title
source: Attention
ru: Внимание

# profile.signInView.anonymous_warning_message
source: You are signed in as a guest. After login, all unsaved data will be lost. To save them, please register first.
ru: Вы вошли как гость. После входа все несохранённые данные будут утеряны. Чтобы сохранить их — сначала зарегистрируйтесь.

# profile.signInView.anonymous_warning_continue
source: Continue login
ru: Продолжить вход

# profile.signInView.anonymous_warning_cancel
source: Cancel
ru: Отмена

# profile.reauthenticateView.title
source: Reauthenticate
ru: Повторная аутентификация

# profile.reauthenticateView.forgot_password
source: Forgot Password?
ru: Забыли пароль?

# profile.reauthenticateView.confirm
source: Confirm
ru: Подтвердить

# profile.reauthenticateView.reauth_google
source: Reauthenticate with Google
ru: Повторная аутентификация через Google

# profile.reauthenticateView.reauth_apple
source: Reauthenticate with Apple
ru: Повторная аутентификация через Apple

# profile.reauthenticateView.email
source: Email
ru: Электронная почта

# profile.reauthenticateView.email_placeholder
source: Enter your email
ru: Введите вашу почту

# profile.reauthenticateView.password
source: Password
ru: Пароль

# profile.reauthenticateView.password_placeholder
source: Enter your password
ru: Введите ваш пароль

# profile.reauthenticateView.or
source: OR
ru: ИЛИ

# profile.forgotPasswordView.title
source: Forgot Password
ru: Забыли пароль

# profile.forgotPasswordView.email
source: Email
ru: Электронная почта

# profile.forgotPasswordView.email_placeholder
source: Enter your email
ru: Введите вашу почту

# profile.forgotPasswordView.send_reset_link
source: Send Reset Link
ru: Отправить ссылку для сброса

# profile.forgotPasswordViewModel.empty_email_error
source: Enter email
ru: Введите email

# profile.forgotPasswordViewModel.invalid_email_error
source: Invalid email
ru: Некорректный email

# gallery.title
source: Gallery
es: Galería
ru: Галерея

# gallery.loading
source: Loading...
es: Cargando...
ru: Загрузка...

# gallery.contentErrorView.title
source: Ups :(
ru: Упс :(

# gallery.contentErrorView.description
source: Try again! Something went wrong!
es: ¡Inténtalo de nuevo! ¡Algo salió mal!
ru: Попробуйте еще раз! Что-то пошло не так!

# gallery.contentErrorView.refresh_button
source: Refresh
es: Actualizar
ru: Обновить

# gallery.galleryCompositView.mallHeader
source: Shopping Centers
es: Centros Comerciales
ru: Торговые Центры

# gallery.galleryCompositView.shopHeader
source: Stores
es: Tiendas
ru: Магазины

# gallery.galleryCompositView.productHeader
source: Popular Products
es: Productos Populares
ru: Популярные товары

# onboarding.back_button
source: Back
es: Atrás
ru: Назад

# onboarding.next_button
source: Next
es: Siguiente
ru: Далее

# onboarding.get_started_button
source: Get started
es: Comenzar
ru: Начать

# onboarding.page_welcome.title
source: Welcome
es: Bienvenido
ru: Добро пожаловать

# onboarding.page_welcome.description
source: Welcome to our app
es: Bienvenido a nuestra aplicación
ru: Добро пожаловать в наше приложение

# onboarding.page_discover.title
source: Discover
es: Descubrir
ru: Обзор

# onboarding.page_discover.description
source: Discover new features
es: Descubre nuevas funciones
ru: Откройте для себя новые функции

# onboarding.page_get_started.title
source: Get started
es: Comenzar
ru: Начать

# onboarding.page_get_started.description
source: Let's get started!
es: ¡Vamos a empezar!
ru: Давайте начнем!

# global.alertView.try_again
source: Try again
ru: Попробовать снова

# global.alertView.ok
source: Ok
ru: Ок

source: Error deleting book
es: Error al eliminar el libro
ru: Ошибка при удалении книги

source: Error authentication
es: Error de autenticación
ru: Ошибка аутентификации

source: Error Database
es: Error de la base de datos
ru: Ошибка базы данных

source: Error adding or changing book
es: Error al agregar o cambiar el libro
ru: Ошибка при добавлении или изменении книги

# error.sign_up
source: Error during sign up
es: Error al registrarse
ru: Ошибка при регистрации

# error.sign_in
source: Error during sign in
es: Error al iniciar sesión
ru: Ошибка при входе в аккаунт

# error.forgot_password
source: Error during password reset
es: Error al restablecer la contraseña
ru: Ошибка при восстановлении пароля

# error.account_deletion
source: Error deleting account
es: Error al eliminar la cuenta
ru: Ошибка при удалении аккаунта

# error.editing_profile_fields
source: Failed to update profile text fields
ru: Ошибка при изменении текстовых данных профиля

# error.fetching_profile_data
source: Failed to fetch profile data
ru: Ошибка при получении данных профиля

# error.deleting_profile_avatar
source: Failed to delete avatar
ru: Не удалось удалить аватар

# error.reauthenticate
source: Reauthentication error
ru: Ошибка повторной аутентификации

# error.forgot_password_operation
source: Password recovery operation error
ru: Ошибка операции восстановления пароля

# title.success.sign_up
source: Sign Up
es: Registro
ru: Регистрация

# title.success.sign_in
source: Sign In
es: Inicio de sesión
ru: Вход

# title.success.account_deletion
source: Account Deletion
es: Eliminación de cuenta
ru: Удаление аккаунта

# title.success.reauthenticate
source: Reauthentication
ru: Аутентификация

# title.success.forgot_password
source: Password Reset
ru: Сброс пароля

# message.success.sign_up
source: You have successfully signed up!
es: ¡Registro exitoso!
ru: Регистрация прошла успешно!

# message.success.sign_in
source: You have successfully signed in!
es: ¡Has iniciado sesión con éxito!
ru: Вы успешно вошли в аккаунт!

# message.success.account_deletion
source: Your account has been successfully deleted.
es: Tu cuenta ha sido eliminada con éxito.
ru: Ваш аккаунт был успешно удалён.

# message.success.reauthenticate
source: Reauthentication completed successfully!
ru: Повторная аутентификация прошла успешно!

# message.success.forgot_password
source: Password reset email has been sent!
ru: Письмо для сброса пароля отправлено!

# error.custom_firebase.default_error
source: Something went wrong. Please try again.
es: Algo salió mal. Por favor, inténtelo de nuevo.
ru: Что-то пошло не так. Пожалуйста, попробуйте еще раз.

# error.custom_firebase.invalid_collection_path
source: The provided path is invalid. It must be a path to a collection, not a document.
es: La ruta proporcionada es inválida. Debe ser una ruta a una colección, no a un documento.
ru: Указанный путь недействителен. Он должен быть путем к коллекции, а не к документу.

# error.custom_firebase.failed_deploy_optional_error
source: Failed to deploy optional error.
es: No se pudo desplegar el error opcional.
ru: Не удалось обработать необязательную ошибку.

# error.custom_firebase.failed_deploy_optional_id
source: Failed to deploy optional ID.
es: No se pudo desplegar el ID opcional.
ru: Не удалось обработать необязательный идентификатор.

# error.custom_firebase.json_conversion_failed
source: JSON conversion failed.
es: Falló la conversión de JSON.
ru: Сбой преобразования JSON.

# error.custom_firebase.not_signed_in
source: No user is currently signed in.
es: Ningún usuario ha iniciado sesión actualmente.
ru: В настоящий момент ни один пользователь не вошел в систему.

# error.anonymous_auth
source: Unknown error occurred during anonymous authentication
es: Error desconocido durante la autenticación anónima
ru: Неизвестная ошибка при анонимной аутентификации

# error.custom_firebase.empty_result
source: No data found.
es: No se encontraron datos.
ru: Данные не найдены.

# error.custom_firebase.nil_snapshot
source: Snapshot is missing. Please try again later.
es: Falta la instantánea. Inténtalo de nuevo más tarde.
ru: Снимок данных отсутствует. Попробуйте позже.

# error.custom_firebase.image_encoding_failed
source: Failed to process the image. Please try a different photo.
ru: Не удалось обработать изображение. Попробуйте другое фото.

# error.custom_firebase.delayed_confirmation
source: The avatar update is taking longer than usual. Confirmation may arrive later.
ru: Обновление аватара занимает больше времени, чем обычно. Подтверждение может прийти позже.

# error.custom_firebase.stale_user_session
source: The current user has changed. Please exit the current screen and try again.
ru: Текущий пользователь изменился. Пожалуйста, выйдите из текущего экрана и попробуйте снова.

# error.auth.provider_already_linked
source: The user is already linked to this provider. Please log in using this provider or link another.
es: El usuario ya está vinculado a este proveedor. Por favor, inicie sesión usando este proveedor o vincule otro.
ru: Пользователь уже связан с этим поставщиком учетных данных. Пожалуйста, войдите, используя этого поставщика, или свяжитесь с другим.

# error.auth.credential_already_in_use
source: The credentials are already in use by another user. Please log in with these credentials or use different ones.
es: Las credenciales ya están en uso por otro usuario. Por favor, inicie sesión con estas credenciales o use otras diferentes.
ru: Учетные данные уже используются другим пользователем. Пожалуйста, войдите с помощью этих учетных данных или используйте другие.

# error.auth.too_many_requests
source: Too many requests have been made to the server in a short time. Please try again later.
es: Se han realizado demasiadas solicitudes al servidor en poco tiempo. Por favor, inténtelo de nuevo más tarde.
ru: Было сделано слишком много запросов к серверу в короткий промежуток времени. Попробуйте повторить попытку позже.

# error.auth.user_token_expired
source: The user token has expired. Please log in again.
es: El token de usuario ha expirado. Por favor, inicie sesión nuevamente.
ru: Токен пользователя истек. Необходим повторный вход в систему.

# error.auth.invalid_user_token
source: The user token is no longer valid. Please log in again.
es: El token de usuario ya no es válido. Por favor, inicie sesión nuevamente.
ru: Токен пользователя больше не действителен. Необходим повторный вход в систему.

# error.auth.user_mismatch
source: The user ID does not match. Please log in again.
es: El ID de usuario no coincide. Por favor, inicie sesión nuevamente.
ru: Идентификатор пользователя не совпадает. Необходим повторный вход в систему.

# error.auth.requires_recent_login
source: You need to log in again before this operation. This is required to confirm your identity and protect your account from unauthorized access. Please log out and log in again to continue.
es: Debe iniciar sesión nuevamente antes de esta operación. Esto es necesario para confirmar su identidad y proteger su cuenta de accesos no autorizados. Por favor, cierre sesión e inicie sesión nuevamente para continuar.
ru: Вам необходимо войти в систему снова перед этой операцией. Это необходимо для подтверждения вашей личности и защиты вашего аккаунта от несанкционированного доступа. Пожалуйста, выйдите из системы и войдите снова, чтобы продолжить.

# error.auth.email_already_in_use
source: The email is already in use by another user. Please log in with this email or use a different one.
es: El correo electrónico ya está en uso por otro usuario. Por favor, inicie sesión con este correo electrónico o use uno diferente.
ru: Электронная почта уже используется другим пользователем. Пожалуйста, войдите с помощью этой электронной почты или используйте другую.

# error.auth.invalid_email
source: The provided email address is invalid or does not match the format of a standard email address. Please ensure you are entering a valid email address.
es: La dirección de correo electrónico proporcionada no es válida o no coincide con el formato de una dirección de correo electrónico estándar. Asegúrese de ingresar una dirección de correo electrónico válida.
ru: Предоставленный адрес электронной почты недействителен или не соответствует формату стандартного адреса электронной почты. Убедитесь, что вы вводите адрес электронной почты в правильном формате.

# error.auth.weak_password
source: The password you entered is too weak. Please enter a stronger password and try again.
es: La contraseña que ingresó es demasiado débil. Por favor, ingrese una contraseña más segura e inténtelo de nuevo.
ru: Введенный пароль слишком слабый. Пожалуйста, введите более сложный пароль и попробуйте снова.

# error.auth.network_error
source: A network error occurred. Please check your internet connection and try again.
es: Ocurrió un error de red. Por favor, verifique su conexión a internet e inténtelo de nuevo.
ru: Произошла сетевая ошибка. Пожалуйста, проверьте свое сетевое подключение и попробуйте снова.

# error.auth.keychain_error
source: There was a problem accessing the credential storage on your device. Please try again or restart your device.
es: Hubo un problema al acceder al almacenamiento de credenciales en su dispositivo. Por favor, inténtelo de nuevo o reinicie su dispositivo.
ru: Проблема с доступом к хранилищу учетных данных на устройстве. Пожалуйста, попробуйте снова или перезагрузите устройство.

# error.auth.user_not_found
source: The email address is not associated with an existing account. Please ensure you are entering the email address used when creating the account.
es: La dirección de correo electrónico no está asociada con una cuenta existente. Asegúrese de ingresar la dirección de correo electrónico utilizada al crear la cuenta.
ru: Адрес электронной почты не связан с существующим аккаунтом. Убедитесь, что вы вводите адрес электронной почты, который был использован при создании аккаунта.

# error.auth.wrong_password
source: The password you entered is incorrect. Please ensure you are entering the correct password for your account.
es: La contraseña que ingresó es incorrecta. Asegúrese de ingresar la contraseña correcta para su cuenta.
ru: Предоставленный пароль неверен. Убедитесь, что вы вводите правильный пароль для своего аккаунта.

# error.auth.expired_action_code
source: The action code has expired. Please request a new code and try again.
es: El código de acción ha expirado. Por favor, solicite un nuevo código e inténtelo de nuevo.
ru: Код действия истек. Пожалуйста, запросите новый код и попробуйте снова.

# error.auth.invalid_credential
source: The provided credentials are invalid. Please check your credentials and try again. If the issue persists, you can reset your password or contact support.
es: Las credenciales proporcionadas no son válidas. Por favor, verifique sus credenciales e inténtelo de nuevo. Si el problema persiste, puede restablecer su contraseña o contactar al soporte.
ru: Предоставленные учетные данные недействительны. Пожалуйста, проверьте свои учетные данные и попробуйте снова. Если проблема не решается, вы можете сбросить свой пароль или обратиться в службу поддержки.

# error.auth.invalid_recipient_email
source: The recipient email address is invalid. Please check the address and try again.
es: La dirección de correo electrónico del destinatario no es válida. Por favor, verifique la dirección e inténtelo de nuevo.
ru: Адрес электронной почты получателя недействителен. Пожалуйста, проверьте адрес и попробуйте снова.

# error.auth.missing_email
source: The email address is missing. Please provide a valid email address and try again.
es: Falta la dirección de correo electrónico. Por favor, proporcione una dirección de correo electrónico válida e inténtelo de nuevo.
ru: Адрес электронной почты отсутствует. Пожалуйста, предоставьте действующий адрес электронной почты и попробуйте снова.

# error.auth.user_disabled
source: The user has been disabled. Please contact your system administrator or support.
es: El usuario ha sido deshabilitado. Por favor, contacte al administrador de su sistema o al soporte.
ru: Пользователь был отключен. Свяжитесь с администратором вашего системы или службой поддержки.

# error.auth.invalid_sender
source: The sender specified in the request is invalid. Please check the sender details and try again.
es: El remitente especificado en la solicitud no es válido. Por favor, verifique los detalles del remitente e inténtelo de nuevo.
ru: Отправитель, указанный в запросе, недействителен. Пожалуйста, проверьте данные отправителя и попробуйте снова.

# error.auth.account_exists_with_different_credential
source: The credentials are already in use with another account. Please use a different login method or use these credentials to log in to the existing account.
es: Las credenciales ya están en uso con otra cuenta. Por favor, use un método de inicio de sesión diferente o use estas credenciales para iniciar sesión en la cuenta existente.
ru: Учетные данные уже используются с другим аккаунтом. Пожалуйста, используйте другой метод входа или используйте эти учетные данные для входа в существующий аккаунт.

# error.auth.operation_not_allowed
source: Accounts with the selected identity provider are not enabled. Please contact your administrator for assistance.
es: Las cuentas con el proveedor de identidad seleccionado no están habilitadas. Por favor, contacte a su administrador para obtener ayuda.
ru: Учетные записи с выбранным поставщиком удостоверений не включены. Пожалуйста, обратитесь к администратору для получения помощи.

# error.auth.generic
source: An authentication error occurred. Please try again.
es: Ocurrió un error de autenticación. Por favor, inténtelo de nuevo.
ru: Произошла ошибка аутентификации. Пожалуйста, попробуйте еще раз.

# error.firestore.cancelled
source: The operation was canceled. Please try again.
es: La operación fue cancelada. Por favor, inténtelo de nuevo.
ru: Операция была отменена. Попробуйте еще раз.

# error.firestore.unavailable
source: The service is temporarily unavailable. Please try again later.
es: El servicio no está disponible temporalmente. Por favor, inténtelo de nuevo más tarde.
ru: Сервис временно недоступен. Попробуйте позже.
