Repository: JohnKlenov/TemplateSwiftUIProject
Catalog: TemplateSwiftUIProject/*.lproj/Localizable.strings
Languages: es, ru

# error.firestore.invalid_argument
source: Invalid arguments were provided. Please check your data and try again.
es: Se proporcionaron argumentos no válidos. Por favor, verifique sus datos e inténtelo de nuevo.
ru: Переданы недопустимые аргументы. Пожалуйста, проверьте данные и попробуйте еще раз.

# error.firestore.unknown
source: An unknown error occurred. Please try again.
es: Ocurrió un error desconocido. Por favor, inténtelo de nuevo.
ru: Произошла неизвестная ошибка. Пожалуйста, попробуйте снова.

# error.firestore.deadline_exceeded
source: The operation deadline was exceeded. Please try again.
es: Se excedió el plazo de la operación. Por favor, inténtelo de nuevo.
ru: Превышен срок выполнения операции. Пожалуйста, повторите попытку.

# error.firestore.not_found
source: The data was not found. Please check your input and try again.
es: No se encontraron los datos. Por favor, verifique su entrada e inténtelo de nuevo.
ru: Данные не найдены. Проверьте правильность введенных данных и попробуйте снова.

# error.firestore.already_exists
source: The data already exists. Please check your data and try again.
es: Los datos ya existen. Por favor, verifique sus datos e inténtelo de nuevo.
ru: Данные уже существуют. Пожалуйста, проверьте данные и попробуйте снова.

# error.firestore.permission_denied
source: Access is denied. Please check your permissions and try again.
es: El acceso está denegado. Por favor, verifique sus permisos e inténtelo de nuevo.
ru: Доступ запрещен. Проверьте разрешения и попробуйте снова.

# error.firestore.resource_exhausted
source: Resources have been exhausted. Please try again later.
es: Los recursos se han agotado. Por favor, inténtelo de nuevo más tarde.
ru: Ресурсы исчерпаны. Попробуйте позже.

# error.firestore.failed_precondition
source: A precondition was not met. Please check your data and try again.
es: No se cumplió una precondición. Por favor, verifique sus datos e inténtelo de nuevo.
ru: Не выполнено предварительное условие. Пожалуйста, проверьте данные и повторите попытку.

# error.firestore.aborted
source: The operation was aborted. Please try again.
es: La operación fue abortada. Por favor, inténtelo de nuevo.
ru: Операция была прервана. Пожалуйста, попробуйте еще раз.

# error.firestore.out_of_range
source: The value is out of range. Please check your data and try again.
es: El valor está fuera de rango. Por favor, verifique sus datos e inténtelo de nuevo.
ru: Значение выходит за пределы допустимого диапазона. Проверьте данные и попробуйте снова.

# error.firestore.unimplemented
source: The feature is not implemented. Please try again later.
es: La función no está implementada. Por favor, inténtelo de nuevo más tarde.
ru: Функция не реализована. Пожалуйста, попробуйте позже.

# error.firestore.internal
source: An internal server error occurred. Please try again later.
es: Ocurrió un error interno del servidor. Por favor, inténtelo de nuevo más tarde.
ru: Произошла внутренняя ошибка сервера. Пожалуйста, повторите попытку позже.

# error.firestore.data_loss
source: Data loss occurred. Please try again.
es: Se produjo una pérdida de datos. Por favor, inténtelo de nuevo.
ru: Произошла потеря данных. Пожалуйста, попробуйте снова.

# error.firestore.unauthenticated
source: The user is not authenticated. Please log in and try again.
es: El usuario no está autenticado. Por favor, inicie sesión e inténtelo de nuevo.
ru: Пользователь не аутентифицирован. Пожалуйста, войдите в систему и попробуйте снова.

# error.firestore.generic
source: An Firestore error occurred. Please try again.
es: Ocurrió un error de Firestore. Por favor, inténtelo de nuevo.
ru: Произошла ошибка Firestore. Пожалуйста, попробуйте еще раз.

# error.storage.object_not_found
source: The file was not found. Please check the path and try again.
es: No se encontró el archivo. Por favor, verifique la ruta e inténtelo de nuevo.
ru: Файл не найден. Проверьте путь и попробуйте снова.

# error.storage.bucket_not_found
source: The specified bucket was not found. Please check your settings and try again.
es: No se encontró el bucket especificado. Por favor, verifique sus configuraciones e inténtelo de nuevo.
ru: Указанное хранилище не найдено. Проверьте настройки и попробуйте снова.

# error.storage.project_not_found
source: The specified project was not found. Please check your project settings and try again.
es: No se encontró el proyecto especificado. Por favor, verifique las configuraciones del proyecto e inténtelo de nuevo.
ru: Указанный проект не найден. Проверьте настройки проекта и попробуйте снова.

# error.storage.quota_exceeded
source: The quota has been exceeded. Please try again later.
es: Se ha excedido la cuota. Por favor, inténtelo de nuevo más tarde.
ru: Превышена квота. Попробуйте позже.

# error.storage.unauthenticated
source: You need to log in to perform this operation. Please authenticate and try again.
es: Debe iniciar sesión para realizar esta operación. Por favor, autentíquese e inténtelo de nuevo.
ru: Необходимо войти в систему для выполнения этой операции. Пожалуйста, аутентифицируйтесь и попробуйте снова.

# error.storage.unauthorized
source: You do not have permission to access this resource.
es: No tiene permiso para acceder a este recurso.
ru: У вас нет разрешения на доступ к этому ресурсу.

# error.storage.retry_limit_exceeded
source: The retry limit has been exceeded. Please try again later.
es: Se ha excedido el límite de reintentos. Por favor, inténtelo de nuevo más tarde.
ru: Превышено количество попыток. Пожалуйста, попробуйте позже.

# error.storage.non_matching_checksum
source: The checksum does not match. Please re-upload the file.
es: La suma de verificación no coincide. Por favor, vuelva a cargar el archivo.
ru: Контрольная сумма не совпадает. Повторите загрузку файла.

# error.storage.download_size_exceeded
source: The download size exceeds the set limit. Please try downloading a smaller file.
es: El tamaño de la descarga excede el límite establecido. Por favor, intente descargar un archivo más pequeño.
ru: Размер загрузки превышает установленный предел. Попробуйте загрузить файл меньшего размера.

# error.storage.cancelled
source: The operation was canceled. Please try again.
es: La operación fue cancelada. Por favor, inténtelo de nuevo.
ru: Операция была отменена. Попробуйте еще раз.

# error.storage.invalid_argument
source: Invalid arguments were provided. Please check your data and try again.
es: Se proporcionaron argumentos no válidos. Por favor, verifique sus datos e inténtelo de nuevo.
ru: Переданы недопустимые аргументы. Пожалуйста, проверьте данные и попробуйте снова.

# error.storage.unknown
source: An unknown error occurred. Please try again.
es: Ocurrió un error desconocido. Por favor, inténtelo de nuevo.
ru: Произошла неизвестная ошибка. Пожалуйста, попробуйте снова.

# error.storage.bucket_mismatch
source: The bucket is incorrect. Please check your settings and try again.
es: El bucket es incorrecto. Por favor, verifique sus configuraciones e inténtelo de nuevo.
ru: Неправильное хранилище. Проверьте настройки и попробуйте снова.

# error.storage.internal_error
source: An internal server error occurred. Please try again later.
es: Ocurrió un error interno del servidor. Por favor, inténtelo de nuevo más tarde.
ru: Внутренняя ошибка сервера. Пожалуйста, попробуйте позже.

# error.storage.path_error
source: There was an error with the path. Please check the path and try again.
es: Hubo un error con la ruta. Por favor, verifique la ruta e inténtelo de nuevo.
ru: Ошибка пути. Проверьте путь и попробуйте снова.

# error.storage.generic
source: An Storage error occurred. Please try again.
es: Ocurrió un error de almacenamiento. Por favor, inténtelo de nuevo.
ru: Произошла ошибка хранилища. Пожалуйста, попробуйте еще раз.

# error.realtime_database.network_error
source: A network error occurred. Please check your connection and try again.
es: Ocurrió un error de red. Por favor, verifique su conexión e inténtelo de nuevo.
ru: Произошла ошибка сети. Пожалуйста, проверьте подключение и попробуйте снова.

# error.realtime_database.timeout
source: The operation timed out. Please try again.
es: El tiempo de espera ha expirado. Por favor, inténtelo de nuevo.
ru: Время ожидания истекло. Пожалуйста, попробуйте снова.

# error.realtime_database.operation_cancelled
source: The operation was canceled. Please try again.
es: La operación fue cancelada. Por favor, inténtelo de nuevo.
ru: Операция была отменена. Попробуйте еще раз.

# error.realtime_database.host_not_found
source: The host could not be found. Please check your network settings and try again.
es: No se pudo encontrar el host. Por favor, verifique sus configuraciones de red e inténtelo de nuevo.
ru: Невозможно найти хост. Проверьте настройки сети и попробуйте снова.

# error.realtime_database.cannot_connect_to_host
source: Could not connect to the host. Please check your connection and try again.
es: No se pudo conectar al host. Por favor, verifique su conexión e inténtelo de nuevo.
ru: Невозможно подключиться к хосту. Проверьте подключение и попробуйте снова.

# error.realtime_database.network_connection_lost
source: The network connection was lost. Please reconnect and try again.
es: Se perdió la conexión de red. Por favor, reconéctese e inténtelo de nuevo.
ru: Потеряно сетевое подключение. Пожалуйста, переподключитесь и попробуйте снова.

# error.realtime_database.resource_unavailable
source: The resource is temporarily unavailable. Please try again later.
es: El recurso no está disponible temporalmente. Por favor, inténtelo de nuevo más tarde.
ru: Ресурс временно недоступен. Попробуйте позже.

# error.realtime_database.authentication_cancelled
source: The user canceled the authentication. Please try again.
es: El usuario canceló la autenticación. Por favor, inténtelo de nuevo.
ru: Пользователь отменил аутентификацию. Попробуйте снова.

# error.realtime_database.authentication_required
source: User authentication is required. Please log in and try again.
es: Se requiere autenticación del usuario. Por favor, inicie sesión e inténtelo de nuevo.
ru: Необходима аутентификация пользователя. Пожалуйста, войдите в систему и попробуйте снова.

# error.realtime_database.generic
source: An realtime database error occurred. Please try again.
es: Ocurrió un error en la base de datos en tiempo real. Por favor, inténtelo de nuevo.
ru: Произошла ошибка базы данных в реальном времени. Пожалуйста, попробуйте еще раз.

# error.google_signin.default_error
source: An unknown error occurred during Google Sign-In.
ru: Произошла неизвестная ошибка при входе через Google.

# error.google_signin.keychain_error
source: Keychain access error.
ru: Ошибка доступа к Keychain.

# error.google_signin.no_handlers
source: No current user.
ru: Нет текущего пользователя.

# error.google_signin.no_auth_in_keychain
source: No authentication tokens found in Keychain.
ru: В Keychain не найдено токенов авторизации.

# error.google_signin.cancelled
source: Sign-In was cancelled by the user.
ru: Вход был отменён пользователем.

# error.google_signin.emm_error
source: Enterprise policy restrictions prevented sign-in.
ru: Корпоративная политика запретила вход.

# error.google_signin.scopes_already_granted
source: Requested scopes have already been granted.
ru: Запрошенные права уже были предоставлены.

# error.google_signin.user_mismatch
source: The signed-in user does not match the current user.
ru: Вошедший пользователь не совпадает с текущим.

# error.google_signin.no_valid_tokens
source: No valid authentication tokens found.
ru: Не найдены действительные токены авторизации.

# error.google_signin.invalid_client_id
source: Invalid client ID or configuration.
ru: Неверный client ID или конфигурация.

# error.google_signin.network_error
source: Network error occurred during sign-in.
ru: Ошибка сети при входе.

# error.google_signin.server_error
source: Google server returned an error.
ru: Сервер Google вернул ошибку.

# error.google_signin.token_exchange_failed
source: Failed to exchange authentication tokens.
ru: Не удалось обменять токены авторизации.

# error.google_signin.scope_error
source: Requested permissions were denied.
ru: Запрошенные разрешения были отклонены.

# error.photo_picker.no_item_available
source: The selected item is not available.
es: El elemento seleccionado no está disponible.
ru: Выбранный элемент недоступен.

# error.photo_picker.item_unavailable
source: The item cannot be loaded.
es: No se puede cargar el elemento.
ru: Элемент нельзя загрузить.

# error.photo_picker.unsupported_type
source: Unsupported media type.
es: Tipo de medio no compatible.
ru: Неподдерживаемый тип медиа.

# error.photo_picker.icloud_required
source: A network connection is required to download from iCloud.
es: Se requiere conexión a la red para descargar desde iCloud.
ru: Требуется подключение к сети для загрузки из iCloud.

# error.photo_picker.load_failed
source: Failed to load the item.
es: No se pudo cargar el elemento.
ru: Не удалось загрузить элемент.

# error.photo_picker.unknown
source: Unknown error.
es: Error desconocido.
ru: Неизвестная ошибка.

# error.picking_image
source: Failed to select photo
es: No se pudo seleccionar la foto
ru: Не удалось выбрать фото

# signup.email_empty
source: Email is required.
es: El correo electrónico es obligatorio.
ru: Email обязательно для заполнения.

# signup.email_invalid
source: Please enter a valid email address.
es: Por favor, introduzca una dirección de correo electrónico válida.
ru: Введите корректный адрес электронной почты.

# signup.password_empty
source: Password is required.
es: La contraseña es obligatoria.
ru: Пароль обязательно для заполнения.

# signup.password_too_short
source: Password must be at least 8 characters.
es: La contraseña debe tener al menos 8 caracteres.
ru: Пароль должен содержать не менее 8 символов.

# signup.password_no_digit
source: Password must contain at least one number.
es: La contraseña debe contener al menos un número.
ru: Пароль должен содержать хотя бы одну цифру.

# signup.password_no_lowercase
source: Password must contain at least one lowercase letter.
es: La contraseña debe contener al menos una letra minúscula.
ru: Пароль должен содержать хотя бы одну строчную букву.

# signup.password_no_uppercase
source: Password must contain at least one uppercase letter.
es: La contraseña debe contener al menos una letra mayúscula.
ru: Пароль должен содержать хотя бы одну заглавную букву.

# signup.email
source: Email
es: Correo electrónico
