//
//  DropTopViewInjected.swift
//  TemplateSwiftUIProject
//
//  Created by Evgenyi on 06.10.2026.
//

//  в details массив с элементами (артист - альбом для отображения как на droplist) - но details мы не будем отображать как на droplist так как в Droptop этот список будт большой и перекроет весь экран на старте - этот список нужно будет отображать на отдельном экране по кнопке!
// для первых тестов не будем реализовывать только на этапе финиша!



// проблемы :

// проверям как работает память на позицию скролла для каждого тега?

// нажатие на ячейку в списках работает только если это происходи в зону с текстом ???

// при обновлении данных на домашнем экране мы при переходе на дроптоп не переходдим на новый фетч а почему то используем кэш хотя должны как только данные обновились на главном экране делать новый фетч на всех экранах
// при обновлении на дроп топ списка у нас сразу пропадает список с рывком !
// проблема с тем что скрол повторяет высоту на новых вкладках дроптоп

// сейчас мы при загрузки видим список который начинается с самых ранних лет 2026 а потом листаем вниз до 2030, должно быть на оборот!
// сейчас список тегов в верхней секции экрана зашит в код в виде модели - и это нормально так как DropTop это упрощенный способ пройтись по лучшим трекм года или квартала а так же выборочно по лучшем трекам артиста за текущий год(верхняя сеция домашнего экрана не является частью DropTop - верхняя секция домашнего экрана это витрина, там может быть как что то уникальное так и один из списков DropTop)
// то есть DropTop это лучшее по времнным периодам или по артистам но в произвольном порядке (то есть не по каждому артисту мы будем делать такой список за год)

// .refreshable
// нужен ли нам refreshable  на этом экране ???
// потом что если мы к примеру обновляем tag с годами
// и после повились изменеия то значит нужно менять и .all
// и это требует дополнительной логики
// то есть нужно как минимум при обновлении текущего тага удалить кэш во всех tag ?
// что скажешь может действительно отказаться от refreshable на этом экране?
// ведь мы должны будем механизм обновления на этом экране доработать!
// если мы обновили главный экран то есть сделали refreshable то при повторном переходе на DropTopContentView нужно заново подгружать данные из сети и чистить кэшь потому что
// могут появится свежие данные на главном экране которых уже не будет в DropTopContentView
// на каком экране мы это уже реализовывали?



// cмотри я усомнился в том что нам нужно иметь два viewState - viewState = .error и iewState = .tagError
// мы могли бы упростить и использовать один viewState = .error как для ошибок при первой загрузки viewModel.setupViewModel() так и при ошибках при viewModel.selectTag(tag) (когда мы впервые заходим на tag)
// и более того мы могли бы использовать в обоих случаяя вне зависимости от того откуда пришла ошибка при первом запуске или при переходе на новый таг один общий метод func retry() и удалить func retrySelectedTag()
//
// и убрать showFullScreenError

//func retry() async {
//
//    await load(
//        tag: selectedTag,
//        useCache: false,
//        showFullScreenError: true
//    )
//}

//func setupViewModel() async {
//    await load(
//        tag: .all,
//        useCache: true,
//        showFullScreenError: true
//    )
//}



import SwiftUI

struct DropTopViewInjected: View {

    @StateObject private var viewModel: DropTopViewModel

    init(
        dropListDataSource: DropListDataSource
    ) {
        _viewModel = StateObject(
            wrappedValue: DropTopViewModel(
                dropListDataSource: dropListDataSource
            )
        )
    }

    var body: some View {
        DropTopContentView(
            viewModel: viewModel
        )
    }
}
